online_benchmark_log/mi30x/DeepSeek-V3-0324/v0.5.3.post1-rocm630-mi30x-20251013_DeepSeek-V3-0324_FP8_online/sglang_serving_benchmark_concurrency_128_run1_20251014_013603.log
Run started at: 2025-10-14 01:36:03 PDT
Using 500 prompts for concurrency 128
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation')
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/mnt/raid/models/huggingface/deepseek-ai/DeepSeek-V3-0324', tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation')

Downloading from https://huggingface.co/datasets/anon8231489123/ShareGPT_Vicuna_unfiltered/resolve/main/ShareGPT_V3_unfiltered_cleaned_split.json to /tmp/ShareGPT_V3_unfiltered_cleaned_split.json
/tmp/ShareGPT_V3_unfiltered_cleaned_split.json: 100%|██████████| 642M/642M [00:12<00:00, 52.1MB/s]
#Input tokens: 1600000
#Output tokens: 400000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [04:03<00:00,  2.06it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     500       
Benchmark duration (s):                  243.12    
Total input tokens:                      1600000   
Total input text tokens:                 1600000   
Total input vision tokens:               0         
Total generated tokens:                  400000    
Total generated tokens (retokenized):    397901    
Request throughput (req/s):              2.06      
Input token throughput (tok/s):          6581.20   
Output token throughput (tok/s):         1645.30   
Total token throughput (tok/s):          8226.50   
Concurrency:                             125.06    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   60808.93  
Median E2E Latency (ms):                 61328.91  
---------------Time to First Token----------------
Mean TTFT (ms):                          10894.00  
Median TTFT (ms):                        10824.03  
P99 TTFT (ms):                           20471.94  
---------------Inter-Token Latency----------------
Mean ITL (ms):                           62.48     
Median ITL (ms):                         51.10     
P95 ITL (ms):                            52.52     
P99 ITL (ms):                            54.41     
Max ITL (ms):                            19713.34  
==================================================
Run completed at: 2025-10-14 01:40:39 PDT
Run duration: 276 seconds